{
  "error" : {
    "TwoFactorCodeExpired" : "Oh no, looks like your 2FA code took a vacation! It's expired now.",
    "emailDoesntExist" : "That email seems to be as elusive as a unicorn. Can't find it anywhere!",
    "emailInUse" : "Whoa there, looks like someone beat you to the punch with that email. Already in use!",
    "expiredToken" : "Token has expired, like last week's leftovers in the fridge.",
    "generic" : "Oops! Something went wrong. Gremlins in the system, perhaps?",
    "invalid2FAToken" : "Invalid 2FA code. Did you try '1234'? Just kidding, don't actually try that.",
    "invalidCredentials" : "Invalid credentials. Did you type your password with your eyes closed?",
    "invalidToken" : "Invalid token. Looks like someone's trying to be sneaky.",
    "noPasswordField" : "This user doesn't use passwords. Maybe they're a ninja.",
    "noPermissions" : "Not enough permissions. You're not the boss here, apparently.",
    "noToken" : "Missing token. Did you check under the couch cushions?",
    "noUser" : "Not authorized. Maybe try wearing a disguise next time.",
    "parseError" : "Invalid fields. Did you try entering your name as 'Princess Consuela Banana-Hammock'?",
    "reusePassword" : "Cannot use the same password. Time to get creative with your password choices!"
  },
  "success" : {
    "confirmationEmailSent" : "Confirmation email sent. Your email is now on a mission.",
    "emailVerified" : "Email verified. Your email is now officially a member of the club.",
    "loggedIn" : "Logged in. Welcome back, you magical unicorn of the internet!",
    "passwordUpdated" : "Password updated. Your password just got a makeover!",
    "resetEmailSent" : "Password reset email sent. Your password is getting a makeover!",
    "productDeleted" : "Product deleted successfully. Say goodbye to that digital ghost!",
    "productUpdated" : "Product updated successfully. Your product is now sporting a fresh coat of digital paint!",
    "categoryDeleted" : "Category deleted successfully. Another one bites the dust!",
    "categoryUpdated" : "Category updated successfully. Category, upgraded!",
    "categoryCreated" : "Category created successfully. A new category has entered the digital world!",
    "userDeleted" : "User deleted successfully. Adios, user!",
    "userUpdated" : "User updated successfully. User, upgraded!"
  },

  "misc" : {
    "passwordAlreadyInUse" : "This password is already used by %, try something different"
  }
}