{
  "error" : {
    "TwoFactorCodeExpired" : "Your 2FA code is older than a dinosaur fossil. Try again!",
    "emailDoesntExist" : "That email address is playing hide-and-seek. Are you sure you typed it right?",
    "emailInUse" : "This email is already a VIP member. Try a different one!",
    "expiredToken" : "Your token took a coffee break and forgot to come back. Please refresh!",
    "generic" : "Oops! Something went wrong. We're blaming the gremlins.",
    "invalid2FAToken" : "That 2FA code is about as accurate as a weather forecast. Try again!",
    "invalidCredentials" : "Your username and password are having a disagreement. Please introduce them again.",
    "invalidToken" : "Your token decided to go on vacation without you. Please get a new one.",
    "noPasswordField" : "This user is living life on the edge, password-free! Try logging in differently.",
    "noPermissions" : "You're trying to sneak into the VIP lounge without a pass. No can do!",
    "noToken" : "Your token is missing in action. It might be hanging out with Elvis.",
    "noUser" : "You're not authorized, but you *are* awesome! Try logging in or signing up.",
    "parseError" : "These fields are a bit jumbled. It's like trying to read a cat's handwriting.",
    "reusePassword" : "This password is feeling déjà vu. Please pick a fresh one!"
  },

  "success" : {
    "confirmationEmailSent" : "Great! A confirmation email is on its way. Check your inbox (and spam folder, just in case).",
    "emailVerified" : "Your email is verified and ready to party!",
    "loggedIn" : "Welcome back! We missed you (not really, but it sounds nice).",
    "passwordUpdated" : "Your password has had a makeover. It looks fabulous!",
    "resetEmailSent" : "Don't worry, a reset email is winging its way to you right now.",
    "productDeleted" : "Poof! The product vanished like a magician's rabbit.",
    "productUpdated" : "Your product got an upgrade and is looking sharp!",
    "categoryDeleted" : "That category is now history. Time to make a new one!",
    "categoryUpdated" : "Your category got a fresh coat of paint. It's looking snazzy!",
    "categoryCreated" : "A new category is born! It's like having a new baby (but without the diapers).",
    "userDeleted" : "This user has left the building. We wish them well on their new adventures.",
    "userUpdated": "This user got a glow-up! Looking good!"
  },

  "misc" : {
    "passwordAlreadyInUse" : "This password is already used by %, try something different"
  }
}